In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "Name" : ['Mohit','Sarvesh','Saharsh','Tejas'],
    "Marks" : [30,24,24,28],
    "City" : ['Nagpur','Chandrpur','jabalpur','Bhandara']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

      Name  Marks       City
0    Mohit     30     Nagpur
1  Sarvesh     24  Chandrpur
2  Saharsh     24   jabalpur
3    Tejas     28   Bhandara

In [5]:
#how to export to csv file
df.to_csv('Friends.csv')  #default 'Index = True'

In [6]:
#to remove index from file
df.to_csv('FriendsIndexFalse.csv',index = False)

In [7]:
#If the file is large then use head to print Data

df.head(2) #if argument in not specified then only 5 elements will display

      Name  Marks       City
0    Mohit     30     Nagpur
1  Sarvesh     24  Chandrpur

In [8]:
#similary to print from downward side
df.tail(2)

      Name  Marks      City
2  Saharsh     24  jabalpur
3    Tejas     28  Bhandara

In [9]:
df.describe().mean()  #It Evaluate only Numerical columns

Marks    20.75
dtype: float64

In [10]:
#to Get the csv File form folder
Data = pd.read_csv('Weather_data.csv')

In [11]:
Data

   Unnamed: 0         day  temperature  windspeed   event
0           0  01/01/2017         32.0        6.0  Cloudy
1           1  01/04/2017          NaN        9.0   Sunny
2           2  01/05/2017         28.0        NaN    Snow
3           3  01/06/2017          NaN        7.0     NaN
4           4  01/07/2017         32.0        NaN    Rain
5           5  01/08/2017          NaN        NaN   Sunny
6           6  01/09/2017          NaN        NaN     NaN
7           7  01/10/2017         34.0        8.0  Cloudy
8           8  01/11/2017         40.0       12.0   Sunny

In [12]:
Data.describe()

       Unnamed: 0  temperature  windspeed
count    9.000000      5.00000   5.000000
mean     4.000000     33.20000   8.400000
std      2.738613      4.38178   2.302173
min      0.000000     28.00000   6.000000
25%      2.000000     32.00000   7.000000
50%      4.000000     32.00000   8.000000
75%      6.000000     34.00000   9.000000
max      8.000000     40.00000  12.000000

In [13]:
Data.head()

   Unnamed: 0         day  temperature  windspeed   event
0           0  01/01/2017         32.0        6.0  Cloudy
1           1  01/04/2017          NaN        9.0   Sunny
2           2  01/05/2017         28.0        NaN    Snow
3           3  01/06/2017          NaN        7.0     NaN
4           4  01/07/2017         32.0        NaN    Rain

In [14]:
Data['event']

0    Cloudy
1     Sunny
2      Snow
3       NaN
4      Rain
5     Sunny
6       NaN
7    Cloudy
8     Sunny
Name: event, dtype: object

In [15]:
Data['event'][0]

'Cloudy'

In [16]:
Data['event'][0] = 'Cloudy'

/var/folders/t2/_07492dj083d4y2snbxbp70w0000gn/T/ipykernel_671/3442339913.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Data['event'][0] = 'Cloudy'

In [17]:
Data['event'][0]

'Cloudy'

In [18]:
Data.to_csv('Weather_data.csv') #to save an result

In [19]:
#we already have an one upper data Frame 'df'
df

      Name  Marks       City
0    Mohit     30     Nagpur
1  Sarvesh     24  Chandrpur
2  Saharsh     24   jabalpur
3    Tejas     28   Bhandara

In [20]:
#change the indexing
df.index = ['a','b','c','d']

In [21]:
df

      Name  Marks       City
a    Mohit     30     Nagpur
b  Sarvesh     24  Chandrpur
c  Saharsh     24   jabalpur
d    Tejas     28   Bhandara